Repository: svipm/doer
Catalog: Doer/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

# %@ Boost 了你的帖子
source: %1$@ Boosted your post
zh_hans: %1$@ Boost 了你的帖子
zh_hk: %1$@ Boost 了你的帖子

# %@ 关注了你
source: %1$@ followed you
zh_hans: %1$@ 关注了你
zh_hk: %1$@ 關注了你

# %@ 创建了新话题
source: %1$@ created a new topic
zh_hans: %1$@ 创建了新话题
zh_hk: %1$@ 創建了新話題

# %@ 发布了新帖
source: %1$@ posted
zh_hans: %1$@ 发布了新帖
zh_hk: %1$@ 發佈了新帖

# %@ 发来了私信
source: %1$@ sent you a message
zh_hans: %1$@ 发来了私信
zh_hk: %1$@ 發來了私信

# %@ 发来了聊天消息
source: %1$@ sent a chat message
zh_hans: %1$@ 发来了聊天消息
zh_hk: %1$@ 發來了聊天消息

# %@ 和其他 %lld 人赞了你的帖子
source: %1$@ and %2$lld others liked your post
zh_hans: %1$@ 和其他 %2$lld 人赞了你的帖子
zh_hk: %1$@ 和其他 %2$lld 人贊了你的帖子

# %@ 回复了你的帖子
source: %1$@ replied to your post
zh_hans: %1$@ 回复了你的帖子
zh_hk: %1$@ 回復了你的帖子

# %@ 回复了话题
source: %1$@ replied to the topic
zh_hans: %1$@ 回复了话题
zh_hk: %1$@ 回復了話題

# %@ 在关注的分类/标签发了新帖
source: %1$@ posted in a watched category/tag
zh_hans: %1$@ 在关注的分类/标签发了新帖
zh_hk: %1$@ 在關注的分類/標籤發了新帖

# %@ 在帖子中提及了你
source: %1$@ mentioned you in a post
zh_hans: %1$@ 在帖子中提及了你
zh_hk: %1$@ 在帖子中提及了你

# %@ 在聊天中引用了你
source: %1$@ quoted you in chat
zh_hans: %1$@ 在聊天中引用了你
zh_hk: %1$@ 在聊天中引用了你

# %@ 在聊天中提及了你
source: %1$@ mentioned you in chat
zh_hans: %1$@ 在聊天中提及了你
zh_hk: %1$@ 在聊天中提及了你

# %@ 对你的帖子做出了反应
source: %1$@ reacted to your post
zh_hans: %1$@ 对你的帖子做出了反应
zh_hk: %1$@ 對你的帖子做出了反應

# %@ 引用了你的帖子
source: %1$@ quoted your post
zh_hans: %1$@ 引用了你的帖子
zh_hk: %1$@ 引用了你的帖子

# %@ 接受了邀请
source: %1$@ accepted the invite
zh_hans: %1$@ 接受了邀请
zh_hk: %1$@ 接受了邀請

# %@ 提及了群组
source: %1$@ mentioned a group
zh_hans: %1$@ 提及了群组
zh_hk: %1$@ 提及了羣組

# %@ 有 %lld 条新消息
source: %1$@ has %2$lld new messages
zh_hans: %1$@ 有 %2$lld 条新消息
zh_hk: %1$@ 有 %2$lld 條新消息

# %@ 点赞了你的 %lld 个帖子
source: %1$@ liked %2$lld of your posts
zh_hans: %1$@ 点赞了你的 %2$lld 个帖子
zh_hk: %1$@ 點讚了你的 %2$lld 個帖子

# %@ 移动了帖子
source: %1$@ moved a post
zh_hans: %1$@ 移动了帖子
zh_hk: %1$@ 移動了帖子

# %@ 等 %lld 人 Boost 了你的帖子
source: %1$@ and %2$lld others Boosted your post
zh_hans: %1$@ 等 %2$lld 人 Boost 了你的帖子
zh_hk: %1$@ 等 %2$lld 人 Boost 了你的帖子

# %@ 编辑了帖子
source: %1$@ edited a post
zh_hans: %1$@ 编辑了帖子
zh_hk: %1$@ 編輯了帖子

# %@ 评论了你的问答
source: %1$@ commented on your Q&A
zh_hans: %1$@ 评论了你的问答
zh_hk: %1$@ 評論了你的問答

# %@ 赞了你的帖子
source: %1$@ liked your post
zh_hans: %1$@ 赞了你的帖子
zh_hk: %1$@ 贊了你的帖子

# %@ 邀请你加入私信
source: %1$@ invited you to a message
zh_hans: %1$@ 邀请你加入私信
zh_hk: %1$@ 邀請你加入私信

# %@ 邀请你加入聊天
source: %1$@ invited you to chat
zh_hans: %1$@ 邀请你加入聊天
zh_hk: %1$@ 邀請你加入聊天

# %@ 邀请你加入话题
source: %1$@ invited you to a topic
zh_hans: %1$@ 邀请你加入话题
zh_hk: %1$@ 邀請你加入話題

# %@ 邀请你参加活动
source: %1$@ invited you to an event
zh_hans: %1$@ 邀请你参加活动
zh_hk: %1$@ 邀請你參加活動

# %@ 链接了你的 %lld 个帖子
source: %1$@ linked %2$lld of your posts
zh_hans: %1$@ 链接了你的 %2$lld 个帖子
zh_hk: %1$@ 連結了你的 %2$lld 個帖子

# %@ 链接了你的帖子
source: %1$@ linked your post
zh_hans: %1$@ 链接了你的帖子
zh_hk: %1$@ 連結了你的帖子

# %@、%@ 赞了你的帖子
source: %1$@ and %2$@ liked your post
zh_hans: %1$@、%2$@ 赞了你的帖子
zh_hk: %1$@、%2$@ 贊了你的帖子

# %lld 人申请加入 %@
source: %1$lld people requested to join %2$@
zh_hans: %1$lld 人申请加入 %2$@
zh_hk: %1$lld 人申請加入 %2$@

# action.add
source: Add
zh_hans: 添加
zh_hk: 添加

# action.cancel
source: Cancel
zh_hans: 取消
zh_hk: 取消

# action.clear
source: Clear
zh_hans: 清空
zh_hk: 清空

# action.confirm
source: Confirm
zh_hans: 确认
zh_hk: 確認

# action.copy
source: Copy
zh_hans: 复制
zh_hk: 複製

# action.delete
source: Delete
zh_hans: 删除
zh_hk: 刪除

# action.enable
source: Enable
zh_hans: 开启
zh_hk: 開啓

# action.no_thanks
source: No Thanks
zh_hans: 不了
zh_hk: 不了

# action.ok
source: OK
zh_hans: 好
zh_hk: 好

# action.open
source: Open
zh_hans: 打开
zh_hk: 打開

# action.refresh
source: Refresh
zh_hans: 刷新
zh_hk: 刷新

# action.rename
source: Rename
zh_hans: 重命名
zh_hk: 重命名

# action.reply
source: Send
zh_hans: 发送
zh_hk: 發送

# action.reset
source: Reset
zh_hans: 重置
zh_hk: 重設

# action.retry
source: Retry
zh_hans: 重试
zh_hk: 重試

# action.save
source: Save
zh_hans: 保存
zh_hk: 保存

# action.share
source: Share
zh_hans: 分享
zh_hk: 分享

# add_forum.button
source: Add Forum
zh_hans: 添加论坛
zh_hk: 添加論壇

# add_forum.error.connect %@
source: Could not connect: %@
zh_hans: 无法连接：%@
zh_hk: 無法連接：%@

# add_forum.error.empty_url
source: Please enter a URL
zh_hans: 请输入论坛地址
zh_hk: 請輸入論壇地址

# add_forum.error.invalid_url
source: Invalid URL
zh_hans: 无效的地址
zh_hk: 無效的地址

# add_forum.title
source: Add Forum
zh_hans: 添加论坛
zh_hk: 添加論壇

# ai.advanced.context
source: Default context range
zh_hans: 默认上下文范围
zh_hk: 默認上下文範圍

# ai.advanced.context.help
source: How many topic posts to include by default when opening the AI assistant.
zh_hans: 打开 AI 助手时默认携带的话题楼层数量。
zh_hk: 打開 AI 助手時默認攜帶的話題樓層數量。

# ai.advanced.system_prompt
source: Custom system prompt
zh_hans: 自定义系统提示词
zh_hk: 自定義系統提示詞

# ai.advanced.system_prompt.help
source: Appended after the default system prompt. Leave empty to skip.
zh_hans: 会追加在默认系统提示之后，留空表示不追加。
zh_hk: 會追加在默認系統提示之後，留空表示不追加。

# ai.advanced.title
source: Advanced
zh_hans: 高级设置
zh_hk: 高級設置

# ai.chat.ask_headline
source: AI answers based on the topic
zh_hans: AI 会基于话题内容为你解答
zh_hk: AI 會基於話題內容為你解答

# ai.chat.ask_hint
source: Ask the AI assistant
zh_hans: 向 AI 助手提问
zh_hk: 向 AI 助手提問

# ai.chat.error
source: Request failed: %@
zh_hans: 请求失败：%@
zh_hk: 請求失敗：%@

# ai.chat.go_configure
source: Configure
zh_hans: 去配置
zh_hk: 去配置

# ai.chat.input.placeholder
source: Message...
zh_hans: 输入消息...
zh_hk: 輸入消息...

# ai.chat.more_prompts
source: More
zh_hans: 更多
zh_hk: 更多

# ai.chat.new_session
source: New chat
zh_hans: 新对话
zh_hk: 新對話

# ai.chat.no_model
source: Configure AI Model Service and choose a default model first
zh_hans: 请先在 AI 模型服务中配置并选择默认模型
zh_hk: 請先在 AI 模型服務中配置並選擇默認模型

# ai.chat.pick_model
source: Choose model
zh_hans: 选择模型
zh_hk: 選擇模型

# ai.chat.thinking
source: Thinking…
zh_hans: 思考中…
zh_hk: 思考中…

# ai.chat.title
source: AI Assistant
zh_hans: AI 助手
zh_hk: AI 助手

# ai.context.all
source: All posts
zh_hans: 全部楼层
zh_hk: 全部樓層

# ai.context.first_post
source: Original post only
zh_hans: 仅主帖
zh_hk: 僅主帖

# ai.context.first5
source: First 5 posts
zh_hans: 前 5 楼
zh_hk: 前 5 樓

# ai.context.first10
source: First 10 posts
zh_hans: 前 10 楼
zh_hk: 前 10 樓

# ai.context.first20
source: First 20 posts
zh_hans: 前 20 楼
zh_hk: 前 20 樓

# ai.error.bad_payload
source: Couldn’t parse the response
zh_hans: 响应格式无法解析
zh_hk: 響應格式無法解析

# ai.error.forbidden
source: You don’t have access
zh_hans: 没有访问权限
zh_hk: 沒有訪問權限

# ai.error.invalid_url
source: Invalid API URL
zh_hans: API 地址无效
zh_hk: API 地址無效

# ai.error.key_invalid
source: API key is invalid or expired
zh_hans: API Key 无效或已过期
zh_hk: API Key 無效或已過期

# ai.error.not_found
source: Endpoint not found. Check the API URL
zh_hans: 接口不存在，请检查 API 地址
zh_hk: 接口不存在，請檢查 API 地址

# ai.error.rate_limited
source: Too many requests. Try again later
zh_hans: 请求过于频繁，请稍后再试
zh_hk: 請求過於頻繁，請稍後再試

# ai.error.request_failed
source: Request failed (%d)
zh_hans: 请求失败（%d）
zh_hk: 請求失敗（%d）

# ai.error.server
source: Server error (%d)
zh_hans: 服务器错误（%d）
zh_hk: 伺服器錯誤（%d）

# ai.history.empty
source: No chat history yet
zh_hans: 还没有聊天记录
zh_hk: 還沒有聊天記錄

# ai.history.title
source: Chat history
zh_hans: 聊天记录
zh_hk: 聊天記錄

# ai.hub.default_model
source: Default model
zh_hans: 默认模型
zh_hk: 默認模型

# ai.hub.providers
source: Providers
zh_hans: 供应商
zh_hk: 供應商

# ai.hub.providers.count
source: %d providers
zh_hans: %d 个供应商
zh_hk: %d 個供應商

# ai.hub.providers.none
source: No AI providers configured
zh_hans: 还没有配置 AI 供应商
zh_hk: 還沒有配置 AI 供應商

# ai.model.tag.image
source: Image
zh_hans: 生图
zh_hk: 生圖

# ai.model.tag.reasoning
source: Reasoning
zh_hans: 推理
zh_hk: 推理

# ai.model.tag.tool
source: Tools
zh_hans: 工具
zh_hk: 工具

# ai.model.tag.vision
source: Vision
zh_hans: 视觉
zh_hk: 視覺

# ai.preset.highlights
source: What’s worth noticing
zh_hans: 有什么值得关注的
zh_hk: 有什麼值得關注的

# ai.preset.highlights.prompt
source: What information or highlights in this topic are worth noticing?
zh_hans: 这个话题中有哪些值得关注的信息或亮点？
zh_hk: 這個話題中有哪些值得關注的信息或亮點？

# ai.preset.summarize
source: Summarize this topic
zh_hans: 总结这个话题
zh_hk: 總結這個話題

# ai.preset.summarize.prompt
source: Briefly summarize this topic’s main points and discussion.
zh_hans: 请简要总结这个话题的主要内容和讨论要点。
zh_hk: 請簡要總結這個話題的主要內容和討論要點。

# ai.preset.translate
source: Translate the original post
zh_hans: 翻译主帖
zh_hk: 翻譯主帖

# ai.preset.translate.prompt
source: Translate the original post into English.
zh_hans: 请将主帖内容翻译成英文。
zh_hk: 請將主帖內容翻譯成英文。

# ai.preset.viewpoints
source: List main viewpoints
zh_hans: 列出主要观点
zh_hk: 列出主要觀點

# ai.preset.viewpoints.prompt
source: List the main viewpoints and stances in this topic.
zh_hans: 请列出这个话题中各楼层的主要观点和立场。
zh_hk: 請列出這個話題中各樓層的主要觀點和立場。

# ai.presets.add
source: Add shortcut
zh_hans: 添加快捷词
zh_hk: 添加快捷詞

# ai.presets.edit
source: Edit shortcut
zh_hans: 编辑快捷词
zh_hk: 編輯快捷詞

# ai.presets.empty
source: No shortcuts yet. Tap + in the top right to add one
zh_hans: 还没有快捷词，点右上角 + 添加
zh_hk: 還沒有快捷詞，點右上角 + 添加

# ai.presets.footer
source: Shortcuts appear at the bottom of the AI assistant. Tap one to send it.
zh_hans: 快捷词显示在 AI 助手底部，点按即可向 AI 发送对应内容。
zh_hk: 快捷詞顯示在 AI 助手底部，點按即可向 AI 發送對應內容。

# ai.presets.manage.subtitle
source: Manage shortcuts at the bottom of the AI assistant
zh_hans: 管理 AI 助手底部的快捷词
zh_hk: 管理 AI 助手底部的快捷詞

# ai.presets.manage.title
source: Shortcuts
zh_hans: 快捷词管理
zh_hk: 快捷詞管理

# ai.presets.name
source: Name, e.g. Summarize this topic
zh_hans: 名称，例如 总结这个话题
zh_hk: 名稱，例如 總結這個話題

# ai.presets.prompt
source: Text sent to the AI
zh_hans: 发送给 AI 的内容
zh_hk: 發送給 AI 的內容

# ai.presets.title
source: Shortcuts
zh_hans: 快捷词
zh_hk: 快捷詞

# ai.provider.delete
source: Delete provider
zh_hans: 删除供应商
zh_hk: 刪除供應商

# ai.provider.delete.help
source: The provider and its Keychain API key will be deleted.
zh_hans: 供应商配置与钥匙串中的 API Key 都会被删除。
zh_hk: 供應商配置與鑰匙串中的 API Key 都會被刪除。

# ai.provider.delete.title
source: Delete provider?
zh_hans: 删除供应商？
zh_hk: 刪除供應商？

# ai.provider.fetch_models
source: Fetch models
zh_hans: 拉取模型列表
zh_hk: 拉取模型列表

# ai.provider.fetching
source: Fetching models…
zh_hans: 正在拉取模型…
zh_hk: 正在拉取模型…

# ai.provider.key.saved
source: Saved. Leave empty to keep the current key
zh_hans: 已保存，留空表示不修改
zh_hk: 已保存，留空表示不修改

# ai.provider.models.anthropic.help
source: Anthropic uses a built-in model list.
zh_hans: Anthropic 使用预置模型列表。
zh_hk: Anthropic 使用預置模型列表。

# ai.provider.models.help
source: Enable models after fetching. Fetching again keeps what’s already enabled.
zh_hans: 拉取后可按需启用；重新拉取会保留已有的启用状态。
zh_hk: 拉取後可按需啓用；重新拉取會保留已有的啓用狀態。

# ai.provider.name.placeholder
source: Name, e.g. My NewAPI
zh_hans: 名称，例如 My NewAPI
zh_hk: 名稱，例如 My NewAPI

# ai.provider.need_key
source: Enter an API URL and API key first
zh_hans: 请先填写 API 地址和 API Key
zh_hk: 請先填寫 API 地址和 API Key

# ai.provider.need_key_new
source: Enter an API key
zh_hans: 请填写 API Key
zh_hk: 請填寫 API Key

# ai.provider.need_url
source: Enter an API URL
zh_hans: 请填写 API 地址
zh_hk: 請填寫 API 地址

# ai.provider.section.basics
source: Basics · %@
zh_hans: 基本信息 · %@
zh_hk: 基本信息 · %@

# ai.provider.section.basics.help
source: URLs without /v1 are completed automatically. A trailing # uses the URL as-is. The API key is stored in the Keychain.
zh_hans: 地址未包含 /v1 时会自动补全；以 # 结尾表示严格使用原始地址。API Key 保存在钥匙串。
zh_hk: 地址未包含 /v1 時會自動補全；以 # 結尾表示嚴格使用原始地址。API Key 保存在鑰匙串。

# ai.provider.section.models
source: Models
zh_hans: 模型
zh_hk: 模型

# ai.provider.section.models_count
source: Models · %d enabled
zh_hans: 模型 · %d 已启用
zh_hk: 模型 · %d 已啓用

# ai.provider.test
source: Test connection
zh_hans: 测试连接
zh_hk: 測試連接

# ai.provider.test.no_model
source: Fetch and enable at least one model first
zh_hans: 请先拉取并启用至少一个模型
zh_hk: 請先拉取並啓用至少一個模型

# ai.provider.test.ok
source: Connected (%@)
zh_hans: 连接成功（%@）
zh_hk: 連接成功（%@）

# ai.provider.testing
source: Testing…
zh_hans: 测试中…
zh_hk: 測試中…

# ai.review.result
source: Review result
zh_hans: 预审结果
zh_hk: 預審結果

# ai.review.running
source: AI is reviewing…
zh_hans: AI 预审中…
zh_hk: AI 預審中…

# ai.service.add
source: Add provider
zh_hans: 添加供应商
zh_hk: 添加供應商

# ai.service.add.help
source: Choose an API type
zh_hans: 选择接口类型
zh_hk: 選擇接口類型

# ai.service.default_model.none
source: None selected
zh_hans: 未选择
zh_hk: 未選擇

# ai.service.default_model.title
source: Choose default model
zh_hans: 选择默认模型
zh_hk: 選擇默認模型

# ai.service.empty.help
source: Tap here or + in the top right to add one
zh_hans: 点这里或右上角 + 添加
zh_hk: 點這裏或右上角 + 添加

# ai.service.empty.title
source: No AI providers yet
zh_hans: 还没有 AI 供应商
zh_hk: 還沒有 AI 供應商

# ai.service.provider.models
source: %d models enabled
zh_hans: %d 个模型已启用
zh_hk: %d 個模型已啓用

# ai.service.section.providers.help
source: Supports OpenAI-compatible APIs (such as a NewAPI gateway), Gemini, and Anthropic. API keys are stored in the Keychain.
zh_hans: 支持 OpenAI 兼容接口（如 NewAPI 网关）、Gemini 和 Anthropic。API Key 保存在钥匙串中。
zh_hk: 支持 OpenAI 兼容接口（如 NewAPI 網關）、Gemini 和 Anthropic。API Key 保存在鑰匙串中。

# ai.service.title
source: AI Model Service
zh_hans: AI 模型服务
zh_hk: AI 模型服務

# appearance.dark
source: Dark
zh_hans: 深色
zh_hk: 深色

# appearance.light
source: Light
zh_hans: 浅色
zh_hk: 淺色

# appearance.system
source: System
zh_hans: 跟随系统
zh_hk: 跟隨系統

# attachment.download_failed
source: Failed to download attachment
zh_hans: 附件下载失败
zh_hk: 附件下載失敗

# attachment.downloading
source: Downloading Attachment...
zh_hans: 正在下载附件...
zh_hk: 正在下載附件...

# badges.bronze
source: Bronze
zh_hans: 铜徽章
zh_hk: 銅徽章

# badges.detail_title
source: Badge
zh_hans: 徽章详情
zh_hk: 徽章詳情

# badges.empty
source: No badges yet
zh_hans: 暂无徽章
zh_hk: 暫無徽章

# badges.gold
source: Gold
zh_hans: 金徽章
zh_hk: 金徽章

# badges.granted_count %lld
source: Granted %lld times
zh_hans: 已颁发 %lld 次
zh_hk: 已頒發 %lld 次

# badges.granted_suffix %@
source: Granted %@
zh_hans: %@获得
zh_hk: %@獲得

# badges.granted_unknown_time
source: Granted time unknown
zh_hans: 获得时间未知
zh_hk: 獲得時間未知

# badges.grantees
source: Recipients
zh_hans: 获得者
zh_hk: 獲得者

# badges.loading
source: Loading badges...
zh_hans: 正在加载徽章…
zh_hk: 正在加載徽章…

# badges.no_grantees
source: No recipients yet
zh_hans: 暂无获得者
zh_hk: 暫無獲得者

# badges.silver
source: Silver
zh_hans: 银徽章
zh_hk: 銀徽章

# badges.total_earned
source: Earned
zh_hans: 累计获得
zh_hk: 累計獲得

# badges.unit
source: badges
zh_hans: 枚徽章
zh_hk: 枚徽章

# badges.unknown
source: Badge
zh_hans: 徽章
zh_hk: 徽章

# badges.unknown_user
source: User
zh_hans: 用户
zh_hk: 用戶

# boost.author.profile
source: Profile
zh_hans: 主页
zh_hk: 主頁

# boost.flag
source: Report
zh_hans: 举报
zh_hk: 舉報

# boost.flag.already_reported
source: You already reported this Boost
zh_hans: 你已经举报过这条 Boost
zh_hk: 你已經舉報過這條 Boost

# boost.flag.submitted
source: Report submitted
zh_hans: 已提交举报
zh_hk: 已提交舉報

# boost.flag.title
source: Report Boost
zh_hans: 举报 Boost
zh_hk: 舉報 Boost

source: Cancel
zh_hans: 取消
zh_hk: 取消

# categories.login_prompt
source: Log in to browse categories
zh_hans: 登录后浏览分类
zh_hk: 登錄後瀏覽分類

# chat.action.reply
source: Reply
zh_hans: 回复
zh_hk: 回覆

# chat.channel_subtitle
source: Channel
zh_hans: 频道
zh_hk: 頻道

# chat.empty
source: No chat channels (this site may not have Chat enabled)
zh_hans: 暂无聊天频道（站点可能未开启 Chat）
zh_hk: 暫無聊天頻道（站點可能未開啓 Chat）

# chat.image
source: Image
zh_hans: 图片
zh_hk: 圖片

# chat.time.yesterday
source: Yesterday
zh_hans: 昨天
zh_hk: 昨天

# chat.title
source: Chat
zh_hans: 站内聊天
zh_hk: 站內聊天

# chat.unread_count
source: %d unread
zh_hans: %d 条未读
zh_hk: %d 條未讀

# clipboard.topic.message
source: A forum topic link was found on the clipboard
zh_hans: 检测到剪贴板中的论坛话题链接
zh_hk: 檢測到剪貼板中的論壇話題連結

# clipboard.topic.open
source: Open
zh_hans: 打开
zh_hk: 打開

# clipboard.topic.title
source: Open topic link?
zh_hans: 打开话题链接？
zh_hk: 打開話題連結？

# cloudflare.challenge.required
source: Complete the Cloudflare check and try again.
zh_hans: 需要完成 Cloudflare 验证后重试。
zh_hk: 需要完成 Cloudflare 驗證後重試。

# cloudflare.recovering
source: Verified. Reloading…
zh_hans: 验证已通过，正在重新加载…
zh_hk: 驗證已通過，正在重新加載…

# cloudflare.recovering_failed
source: Verified, but content is still loading. Pull to refresh, or leave and open it again.
zh_hans: 验证已通过，但内容仍在加载。请稍候下拉刷新，或退出后重新进入。
zh_hk: 驗證已通過，但內容仍在加載。請稍候下拉刷新，或退出後重新進入。

# cloudflare.verify.instructions
source: Complete the Cloudflare check in this page. When cf_clearance is detected, Doer will sync it for native requests.
zh_hans: 在此页面完成 Cloudflare 验证。检测到 cf_clearance 后，Doer 会同步给原生请求使用。
zh_hk: 在此頁面完成 Cloudflare 驗證。檢測到 cf_clearance 後，Doer 會同步給原生請求使用。

# cloudflare.verify.auto_retrying
source: Network hiccup — retrying automatically (%1$d/%2$d)…
zh_hans: 网络异常，正在自动重试（%1$d/%2$d）…
zh_hk: 網絡異常，正在自動重試（%1$d/%2$d）…

# cloudflare.verify.load_failed
source: The verification page failed to load. Check the network, then tap reload.
zh_hans: 验证页面加载失败。检查网络后点左上角刷新。
zh_hk: 驗證頁面加載失敗。檢查網絡後點左上角刷新。

# cloudflare.verify.success
source: Cloudflare verification passed. The clearance cookie has been synced.
zh_hans: Cloudflare 验证已通过，通关 cookie 已同步。
zh_hk: Cloudflare 驗證已通過，通關 cookie 已同步。

# cloudflare.verify.title
source: Cloudflare Check
zh_hans: Cloudflare 验证
zh_hk: Cloudflare 驗證

# code_block.copy
source: Copy code
zh_hans: 复制代码
zh_hk: 複製代碼

# common.add
source: Add
zh_hans: 添加
zh_hk: 添加

# common.all
source: All
zh_hans: 全部
zh_hk: 全部

# common.back
source: Back
zh_hans: 返回
zh_hk: 返回

# common.cancel
source: Cancel
zh_hans: 取消
zh_hk: 取消

# common.close
source: Close
zh_hans: 关闭
zh_hk: 關閉

# common.continue
source: Continue
zh_hans: 继续
zh_hk: 繼續

# common.create
source: Create
zh_hans: 创建
zh_hk: 創建

# common.customize
source: Customize
zh_hans: 自定义
zh_hk: 自定義

# common.delete
source: Delete
zh_hans: 删除
zh_hk: 刪除

# common.done
source: Done
zh_hans: 完成
zh_hk: 完成

# common.edit
source: Edit
zh_hans: 编辑
zh_hk: 編輯

# common.error
source: Failed
zh_hans: 失败
zh_hk: 失敗

# common.import
source: Import
zh_hans: 导入
zh_hk: 導入

# common.more
source: More
zh_hans: 更多
zh_hk: 更多

# common.next
source: Next
zh_hans: 下一步
zh_hk: 下一步

# common.no_data
source: No data
zh_hans: 暂无数据
zh_hk: 暫無數據

# common.off
source: Off
zh_hans: 关闭
zh_hk: 關閉

# common.ok
source: OK
zh_hans: 确定
zh_hk: 確定

# common.on
source: On
zh_hans: 开启
zh_hk: 開啟

# common.paste
source: Paste
zh_hans: 粘贴
zh_hk: 粘貼

# common.preview
source: Preview
zh_hans: 预览
zh_hk: 預覽

# common.refresh
source: Refresh
zh_hans: 刷新
zh_hk: 刷新

# common.reload
source: Reload
zh_hans: 刷新
zh_hk: 刷新

# common.rename
source: Rename
zh_hans: 重命名
zh_hk: 重命名

# common.retry
source: Retry
zh_hans: 重试
zh_hk: 重試

# common.retry_later
source: Check your network and try again.
zh_hans: 请检查网络后重试。
zh_hk: 請檢查網絡後重試。

# common.save
source: Save
zh_hans: 保存
zh_hk: 保存

# common.save.draft
source: Save draft
zh_hans: 保存草稿
zh_hk: 保存草稿

# common.save.failed
source: Couldn’t save draft
zh_hans: 保存草稿失败
zh_hk: 保存草稿失敗

# crypto.algo.caesar
source: Caesar
zh_hans: 凯撒
zh_hk: 凱撒

# crypto.algo.morse
source: Morse
zh_hans: 摩斯电码
zh_hk: 摩斯電碼

# crypto.algo.railfence
source: Rail fence
zh_hans: 栅栏
zh_hk: 柵欄

# crypto.algo.vigenere
source: Vigenère
zh_hans: 维吉尼亚
zh_hk: 維吉尼亞

# crypto.algorithm
source: Algorithm
zh_hans: 算法
zh_hk: 算法

# crypto.algorithm.empty
source: No matching algorithms
zh_hans: 没有匹配的算法
zh_hk: 沒有匹配的算法

# crypto.algorithm.search
source: Search algorithms
zh_hans: 搜索算法
zh_hk: 搜索算法

# crypto.algorithm.search.results
source: Search results
zh_hans: 搜索结果
zh_hk: 搜索結果

# crypto.auto_detected
source: Detected automatically
zh_hans: 已自动识别
zh_hk: 已自動識別

# crypto.caesar.shift
source: Shift
zh_hans: 移位
zh_hk: 移位

# crypto.category.asymmetric
source: Asymmetric
zh_hans: 非对称
zh_hk: 非對稱

# crypto.category.classic
source: Classic ciphers
zh_hans: 经典密码
zh_hk: 經典密碼

# crypto.category.encoding
source: Encoding
zh_hans: 编码
zh_hk: 編碼

# crypto.category.hash
source: Hash
zh_hans: 哈希
zh_hk: 哈希

# crypto.category.symmetric
source: Symmetric
zh_hans: 对称加密
zh_hk: 對稱加密

# crypto.ciphertext
source: Ciphertext
zh_hans: 密文
zh_hk: 密文

# crypto.copied
source: Copied
zh_hans: 已复制
zh_hk: 已複製

# crypto.copy
source: Copy
zh_hans: 复制
zh_hk: 複製

# crypto.decrypt.action
source: Decrypt
zh_hans: 解密
zh_hk: 解密

# crypto.decrypt.hero
source: Detect the cipher and decrypt. Copy or quote-reply the result.
zh_hans: 自动识别密文算法，解出来可复制或引用回复。
zh_hk: 自動識別密文算法，解出來可複製或引用回復。

# crypto.decrypt.title
source: Decrypt
zh_hans: 解密内容
zh_hk: 解密內容

# crypto.encrypt.action
source: Encrypt
zh_hans: 加密
zh_hk: 加密

# crypto.encrypt.hero
source: Choose an algorithm, then copy or insert the result into the editor.
zh_hans: 选择算法后加密，可复制或插回编辑器。
zh_hk: 選擇算法後加密，可複製或插回編輯器。

# crypto.encrypt.title
source: Encrypt
zh_hans: 加密内容
zh_hk: 加密內容

# crypto.error.empty
source: Enter some text
zh_hans: 请输入内容
zh_hk: 請輸入內容

# crypto.format
source: Output format
zh_hans: 输出格式
zh_hk: 輸出格式

# crypto.format.enc1
source: ENC1 (self-describing)
zh_hans: ENC1（自描述）
zh_hk: ENC1（自描述）

# crypto.insert
source: Insert into editor
zh_hans: 插入编辑器
zh_hk: 插入編輯器

# crypto.password
source: Password
zh_hans: 密码
zh_hk: 密碼

# crypto.pem
source: PEM key
zh_hans: PEM 密钥
zh_hk: PEM 密鑰

# crypto.plaintext
source: Plaintext
zh_hans: 明文
zh_hk: 明文

# crypto.quote_reply
source: Quote reply
zh_hans: 引用回复
zh_hk: 引用回復

# crypto.rail.count
source: Rails
zh_hans: 栅栏数
zh_hk: 柵欄數

# crypto.recent
source: Recent
zh_hans: 最近使用
zh_hk: 最近使用

# crypto.remember_password
source: Remember password
zh_hans: 记住密码
zh_hk: 記住密碼

# crypto.result
source: Result
zh_hans: 结果
zh_hk: 結果

# crypto.settings
source: Encryption settings
zh_hans: 加解密设置
zh_hk: 加解密設置

# crypto.settings.clear
source: Clear remembered passwords
zh_hans: 清除已记住的密码
zh_hk: 清除已記住的密碼

# crypto.settings.clear.done
source: Remembered passwords cleared
zh_hans: 已清除记住的密码
zh_hk: 已清除記住的密碼

# crypto.settings.group
source: Encryption
zh_hans: 加解密
zh_hk: 加解密

# crypto.settings.remember
source: Remember encryption password
zh_hans: 记住加密密码
zh_hk: 記住加密密碼

# crypto.settings.remember.desc
source: The password is stored in the Keychain on this device only.
zh_hans: 密码保存在系统钥匙串，仅本机可用。
zh_hk: 密碼保存在系統鑰匙串，僅本機可用。

# crypto.toolbox.decrypt.subtitle
source: Detect the algorithm and decrypt. Copy the result
zh_hans: 自动识别算法，解出来可复制
zh_hk: 自動識別算法，解出來可複製

# crypto.toolbox.encrypt.subtitle
source: Plaintext → ciphertext. Copy or insert into the editor
zh_hans: 明文 → 密文，可复制或插入编辑器
zh_hk: 明文 → 密文，可複製或插入編輯器

# crypto.toolbox.hero
source: Decrypt selected post text, encrypt from the editor, compatible with openssl ciphertext.
zh_hans: 帖子划词解密，编辑器一键加密，与 openssl 密文互通。
zh_hk: 帖子劃詞解密，編輯器一鍵加密，與 openssl 密文互通。

# crypto.toolbox.intro
source: Select likely ciphertext in a post to decrypt. In the editor, tap the key or + to encrypt and insert. Covers AES, 3DES, ChaCha20, Base64/Hex/ROT13, hashes, RSA, and classic ciphers.
zh_hans: 选中帖子里的疑似密文会出现「解密」。编辑器里点钥匙或「+」菜单即可加密插回。算法覆盖 AES、3DES、ChaCha20、Base64/Hex/ROT13、哈希、RSA 与经典密码。
zh_hk: 選中帖子裏的疑似密文會出現「解密」。編輯器裏點鑰匙或「+」菜單即可加密插回。算法覆蓋 AES、3DES、ChaCha20、Base64/Hex/ROT13、哈希、RSA 與經典密碼。

# crypto.vigenere.key
source: Vigenère key
zh_hans: 维吉尼亚密钥
zh_hk: 維吉尼亞密鑰

# doh.provider.custom
source: Custom
zh_hans: 自定义
zh_hk: 自定義

# doh.provider.tencent
source: Tencent DNS (dns.pub)
zh_hans: 腾讯 DNS (dns.pub)
zh_hk: 騰訊 DNS (dns.pub)

# doh.status.disabled
source: Off
zh_hans: 未启用
zh_hk: 未啓用

# doh.status.encrypted_dns
source: In-app DoH · Encrypted DNS
zh_hans: 应用内 DoH · Encrypted DNS
zh_hk: 應用內 DoH · Encrypted DNS

# doh.status.encrypted_dns_browser
source: In-app DoH · Encrypted DNS · browser passthrough
zh_hans: 应用内 DoH · Encrypted DNS · 浏览器直通
zh_hk: 應用內 DoH · Encrypted DNS · 瀏覽器直通

# doh.status.no_bootstrap
source: Couldn’t start: the DoH server has no bootstrap IP
zh_hans: 启动失败：DoH 服务器没有 bootstrap IP
zh_hk: 啓動失敗：DoH 伺服器沒有 bootstrap IP

# doh.status.running
source: In-app DoH · %@
zh_hans: 应用内 DoH · %@
zh_hk: 應用內 DoH · %@

# doh.status.start_failed
source: Couldn’t start: %@
zh_hans: 启动失败：%@
zh_hk: 啓動失敗：%@

# doh.status.with_browser
source: In-app DoH · %@ · browser
zh_hans: 应用内 DoH · %@ · 浏览器
zh_hk: 應用內 DoH · %@ · 瀏覽器

# draft.reply.topic
source: Reply to topic #%lld
zh_hans: 回复话题 #%lld
zh_hk: 回復話題 #%lld

# draft.reply.topic_floor
source: Reply to topic #%1$lld · post %2$lld
zh_hans: 回复话题 #%1$lld · 楼层 %2$lld
zh_hk: 回復話題 #%1$lld · 樓層 %2$lld

# emoji.activities
source: Activities
zh_hans: 活动
zh_hk: 活動
